#!/usr/bin/env python
# coding: utf-8

# In[1]:


#1.ปูตัวหนึ่ง ตกลงไปในบ่อที่มีความสูง H เมตร มันพยายามจะไต่ให้ถึงปากบ่อ ในเวลากลางวันปูไต่ขึ้นไปได้ U เมตร เวลากลางคืนมันนอนหลับจึงไม่ได้ไต่แต่กลับไถลลงมาเป็นระยะทาง D เมตร ให้เขียนโปรแกรมเพื่อหาว่าปูจะใช้เวลากี่วันในการไต่ออกจากบ่อ (กำหนดให้ปูเริ่มไต่ในเวลากลางวัน)
H = int(input("H: "))
U = int(input("U: "))
D = int(input("D: "))
k = 0
day = 1
while True:
    k = k+U
    if k>=H:
     break
    k = k-D
    day = day+1
print(day,"day(s).")


# In[2]:


#2.ให้เขียนโปรแกรมรับจำนวนเต็ม P และ Sจากนั้นพิมพ์เลขตั้งแต่ 1 ถึง P ที่ S หารลงตัว 
p = int(input("Enter P: "))
s= int(input("Enter S: "))
for x in range(1,p+1):
    if  x%s == 0:
        print(x)


# In[5]:


#3.ร้านขายของชำร้านหนึ่ง พยายามเพิ่มยอดขายโดยการเสนอโปรโมชั่นพิเศษ ถ้าคุณซื้อของมากกว่า 5 อย่าง ที่มีมูลค่ารวมเกิน 100 บาท คุณจะได้ส่วนลด 50% 
count = int(input("ต้องการของ: "))
money = int(input("ราคา: "))
if count > 5 and money > 60:
   s = money-money*0.1
else:
   s = money
print("You have to pay",int(s),"bath.")


# In[6]:


#4.เต่าตัวหนึ่ง ตกลงมาจากสะพานแม่น้ำที่มีความสูง H เมตร มันพยายามจะไต่ขึ้นไปที่เดิม ในเวลากลางวันเต่าไต่ขึ้นไปได้ U เมตร เวลากลางคืนมันหมดแรงจึงไม่ได้ไต่แต่กลับไถลลงมาเป็นระยะทาง D เมตร ให้เขียนโปรแกรมเพื่อหาว่าเต่าจะใช้เวลากี่วันในการไต่สะพานแม่น้ำขึ้นไปที่เดิม (กำหนดให้เต่าเริ่มไต่ในเวลากลางวัน)
H = int(input("H: "))
U = int(input("U: "))
D = int(input("D: "))
k = 0
day = 1
while True:
    k = k+U
    if k>=H:
        break
    k = k-D
    day = day+1
print(day,"day(s).")


# In[9]:


#5.มาลีขายหมูไป 200กิโลกรัม ราคากิโลกรัมละ  140บาท เอาเงินที่ขายได้ไปซื้อสบู่ราคาก้อนละ 100 บาท มาลีจะซื้อสบู่ได้กี่ก้อน กำหนดให้ได้สบู่ 5 ก้อน
P=int(input("ขายหมูไป:"))
S=int(input("ราคากิโลกรัมละ:"))
Soap=int(input("สบู่ก้อนละ:"))
money=P*S
count = int(money//Soap)
print("จะได้สบู่ปริมาณ:",count,"ก้อน")
if count < 1:
    print("ไม่สามารถซื้อได้")
elif count > 40:
    print("เกินจำนวนที่ต้องการ")
else :
   count == 5
   print("ได้ครบตามจำนวน")


# In[11]:


#6.ให้เขียนโปรแกรมรับจำนวนเต็ม L และ G จากนั้นพิมพ์เลขตั้งแต่ 1 ถึงN ที่ M หารลงตัว 
n = int(input("Enter N: "))
m = int(input("Enter M: "))
for x in range(1,n+1):
    if  x%m == 0:
        print(x)


# In[12]:


#7.ร้านขายน้ำปั่นร้านหนึ่ง พยายามเพิ่มยอดขายโดยการเสนอโปรโมชั่นพิเศษ ถ้าคุณซื้อน้ำปั่นมากกว่า 4แก้ว ที่มีมูลค่ารวมเกิน 100 บาท คุณจะได้ส่วนลด 10% 
count = int(input("ต้องการน้ำปั่น: "))
money = int(input("ราคา: "))
if count > 4 and money > 10:
   s = money-money*0.1
else:
   s = money
print("You have to pay",int(s),"bath.")


# In[14]:


#8.นานามีเงิน 5000 บาทซื้อกางเกงไป 5 ตัว ราคาตัวละ  250 บาท เอาเงินที่เหลือไปซื้อเสื้อราคาตัวละ 150 บาท นานาจะซื้อเสื้อได้กี่ตัว กำหนดให้ได้เสื้อ 25 ชิ้น
N=int(input("นานามีเงิน:"))
K=int(input("ซื้อกางเกงไป:"))
P=int(input("กางเกงตัวละ:"))
Pants=K*P
C=int(input("เสื้อตัวละ:"))
money=(N-(K*P))
count = int(money//C)
print("จะได้เสื้อจำนวน:",count,"ตัว")
if count < 1:
    print("ไม่สามารถซื้อได้")
elif count > 100:
    print("เกินจำนวนที่ต้องการ")
else :
   count == 25
   print("ได้ครบตามจำนวน")


# In[15]:


#9.เขียนโปรแกรมรับจำนวนเต็มบวก 1 จำนวน จากนั้นให้แสดงผลลัพธ์เป็นจำนวนเต็มดังกล่าวที่เขียนอยู่ในรูปของตัวเลขฐาน สอง
x = int(input("Enter number: "))
x0 = x
sum = ''
d = 0
z = 0
while True:
   y = int(x%2)
   x = int(x/2)
   sum = str(y)+sum
   if y==1:
      z = z+2**d
   if z==x0:
      break
   d = d+1
z = int(sum)
print(z)


# In[16]:


#10.ให้เขียนรับตัวเลขฐาน 2 จากผู้ใช้ จากนั้นแปลงให้เป็นเลขฐานสิบ
x = input("Enter binary number: ")
d = len(x)-1
sum = 0
for y in x:
   if y == '1':
      sum = sum+2**d
   d = d-1
print(sum)


# In[ ]:




